{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "dtype": "float32", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 4], "kernel_constraint": null, "bias_regularizer": null, "units": 3}, "class_name": "Dense"}], "class_name": "Sequential"}