{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 4], "name": "features", "sparse": false}, "inbound_nodes": [], "name": "features", "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_7", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "units": 3}, "inbound_nodes": [[["features", 0, 0, {}]]], "name": "dense_7", "class_name": "Dense"}], "input_layers": [["features", 0, 0]], "output_layers": [["dense_7", 0, 0]], "name": "model_3"}, "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Model"}