{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "use_bias": true, "name": "dense_7", "kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 4], "units": 3, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}]}