{"keras_version": "2.0.5", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "name": "seq", "config": {"dtype": "float32", "name": "seq", "sparse": false, "batch_input_shape": [null, 101, 4]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["seq", 0, 0, {}]]], "name": "conv1", "config": {"name": "conv1", "trainable": true, "filters": 10, "dilation_rate": [1], "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [9], "use_bias": true, "strides": [1], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv1D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "average_pooling1d_6", "config": {"name": "average_pooling1d_6", "pool_size": [4], "trainable": true, "strides": [4], "padding": "valid"}, "class_name": "AveragePooling1D"}, {"inbound_nodes": [], "name": "dist_polya_st", "config": {"dtype": "float32", "name": "dist_polya_st", "sparse": false, "batch_input_shape": [null, 1, 10]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["average_pooling1d_6", 0, 0, {}]]], "name": "flatten_6", "config": {"name": "flatten_6", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["dist_polya_st", 0, 0, {}]]], "name": "spline_t_6", "config": {"shared_weights": false, "name": "spline_t_6", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "SplineT"}, {"inbound_nodes": [[["flatten_6", 0, 0, {}], ["spline_t_6", 0, 0, {}]]], "name": "concatenate_6", "config": {"name": "concatenate_6", "axis": -1, "trainable": true}, "class_name": "Concatenate"}, {"inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "name": "dense_6", "config": {"name": "dense_6", "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "use_bias": true, "units": 1, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "input_layers": [["seq", 0, 0], ["dist_polya_st", 0, 0]], "name": "model_6", "output_layers": [["dense_6", 0, 0]]}, "class_name": "Model"}