{"backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["features", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 4], "name": "features", "sparse": false}, "name": "features", "class_name": "InputLayer"}, {"inbound_nodes": [[["features", 0, 0, {}]]], "config": {"name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "units": 3, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_1", "class_name": "Dense"}], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.0.9", "class_name": "Model"}