{
    "class_name": "Model", 
    "keras_version": "1.2.2", 
    "config": {
        "layers": [
            {
                "class_name": "InputLayer", 
                "config": {
                    "batch_input_shape": [
                        null, 
                        25025, 
                        1
                    ], 
                    "input_dtype": "float32", 
                    "sparse": false, 
                    "name": "H3K27AC_subsampled"
                }, 
                "inbound_nodes": [], 
                "name": "H3K27AC_subsampled"
            }, 
            {
                "class_name": "Convolution1D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "convolution1d_1", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "filter_length": 25, 
                    "init": "he_normal", 
                    "bias": true, 
                    "nb_filter": 15, 
                    "input_dim": null, 
                    "subsample_length": 1, 
                    "border_mode": "same", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "input_length": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "H3K27AC_subsampled", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution1d_1"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_1"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution1d_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_1"
            }, 
            {
                "class_name": "Convolution1D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "convolution1d_2", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "filter_length": 25, 
                    "init": "he_normal", 
                    "bias": true, 
                    "nb_filter": 15, 
                    "input_dim": null, 
                    "subsample_length": 1, 
                    "border_mode": "same", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "input_length": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_1", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution1d_2"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_2"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution1d_2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_2"
            }, 
            {
                "class_name": "Convolution1D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "convolution1d_3", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "filter_length": 25, 
                    "init": "he_normal", 
                    "bias": true, 
                    "nb_filter": 15, 
                    "input_dim": null, 
                    "subsample_length": 1, 
                    "border_mode": "same", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "input_length": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_2", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution1d_3"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_3"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution1d_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_3"
            }, 
            {
                "class_name": "Convolution1D", 
                "config": {
                    "W_constraint": null, 
                    "b_constraint": null, 
                    "name": "convolution1d_4", 
                    "activity_regularizer": null, 
                    "trainable": true, 
                    "filter_length": 1, 
                    "init": "he_normal", 
                    "bias": true, 
                    "nb_filter": 1, 
                    "input_dim": null, 
                    "subsample_length": 1, 
                    "border_mode": "same", 
                    "b_regularizer": null, 
                    "W_regularizer": null, 
                    "activation": "linear", 
                    "input_length": null
                }, 
                "inbound_nodes": [
                    [
                        [
                            "activation_3", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "convolution1d_4"
            }, 
            {
                "class_name": "Activation", 
                "config": {
                    "activation": "relu", 
                    "trainable": true, 
                    "name": "activation_4"
                }, 
                "inbound_nodes": [
                    [
                        [
                            "convolution1d_4", 
                            0, 
                            0
                        ]
                    ]
                ], 
                "name": "activation_4"
            }
        ], 
        "input_layers": [
            [
                "H3K27AC_subsampled", 
                0, 
                0
            ]
        ], 
        "output_layers": [
            [
                "activation_4", 
                0, 
                0
            ]
        ], 
        "name": "model_1"
    }
}